[
    {
        "id": 2,
        "name": "BetMonitor",
        "header": "Custom Reporting Software for a Gambling Operator",
        "description": "A tool designed for office staff to streamline daily tasks through live betting pattern analysis, reporting tools, and QOL utilities.\n\n- Features a live bet feed, daily/monthly reporting, and utility tools for quick decision-making.\n- Integrates Pipedrive, Google APIs, and internal systems for up-to-date client and compliance data.\n- Provides live sports event updates via news feeds.\n- Plays a critical role in assisting in-house traders with real-time information.",
        "languages": ["Python", "SQL", "Tkinter"],
        "github": "https://github.com/sambanks5/BetMonitor"
    },
    {
        "id": 3,
        "name": "BetCalculator",
        "header": "Frontend for Betcruncher.js by Catena-Media",
        "description": "A calculator tool for calculating bet outcomes, improving customer support and aiding in staff training.\n\n- Built with React and MUI to interface with the Betcruncher.js library.\n- Assists in quickly checking potential returns, verifying payouts, and explaining wager breakdowns.\n- Used both as a utility for staff and a learning tool for new employees.",
        "languages": ["JavaScript", "React", "MUI"],
        "github": "https://github.com/sambanks5/BetCalculator"
    },
    {
        "id": 4,
        "name": "PlaysTVScraper",
        "header": "Web Scraper for Plays.tv Using Wayback Machine",
        "description": "A project to recover lost gaming clips from PlaysTV, a clip-sharing site that shut down in 2019.\n\n- Scraped and retrieved 195 uploaded clips using Selenium and BeautifulSoup.\n- Accessed archived content available through the Internet Archive's Wayback Machine.\n- Recovered personal and friends' video memories for preservation.",
        "languages": ["Python", "BeautifulSoup", "Selenium"],
        "github": "https://github.com/sambanks5/PlaysTvScraper"
    },
    {
        "id": 5,
        "name": "AudioSwitcher",
        "header": "Utility for Switching Audio Devices",
        "description": "A lightweight script for quickly toggling between audio output devices without navigating Windows settings.\n\n- Lists available audio output devices and switches to the next one.\n- Designed for convenience, enabling keybinding for fast access.",
        "languages": ["Python", "NirCmd"],
        "github": "https://github.com/sambanks5/AudioSwitcher"
    },
    {
        "id": 6,
        "name": "BackgroundChecker",
        "header": "Desktop Background Restoration Bot",
        "description": "Background service to maintain a default desktop wallpaper and prevent unauthorized changes...\n\n- Monitors desktop wallpaper changes and resets to the default image if altered.\n- Sends a text notification upon change detection.\n- Opens \"Never Gonna Give You Up\" at full volume as a deterrent.",
        "languages": ["Python"],
        "github": "https://github.com/sambanks5/backgroundChecker"
    },
    {
        "id": 7,
        "name": "RecipeApp",
        "header": "Collaborative Recipe Sharing Application",
        "description": "An ongoing project to create a modern, lightweight alternative to recipe websites.\n\n- Allows users to add, edit, and delete recipes.\n- To include features for liking and commenting on shared recipes.\n- Built as a learning project to enhance skills in React and C#.",
        "languages": ["C#", "React", "MUI"],
        "github": "https://github.com/AlecMoore/RecipeWebsite-WIP-"
    }
]
